Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: wxSizer is the abstract base class used for laying out subwindows in a window.
ja: wxSizer はウィンドウ内にサブウィンドウを配置するために使用される抽象基底クラスです。

source: wxSocketBase is the base class for all socket-related objects, and it defines all basic IO functional...
ja: wxSocketBase はソケットに関連するオブジェクトすべての基底クラスで、基本的な IO 機能をすべて定義しています。

source: wxStaticBoxSizer is a sizer derived from wxBoxSizer but adds a static box around the sizer...
ja: wxStaticBoxSizer は wxBoxSizer を継承したサイザーですが、サイザーの周囲にスタティックボックスを追加します。

source: wxStaticCastEvent( wxPlotEventFunction, & fn ), (wxObject *) NULL ), // code implementing the event type and the event class DEFINE_EVENT_TYPE( wxEVT_PLOT_ACTION ) wxPlotEvent::wxPlotEvent( ... // user code intercepting the event BEGIN_EVENT_TABLE(MyFrame, wxFrame)
ja: wxStaticCastEvent( wxPlotEventFunction, & fn ), (wxObject *) NULL ), // イベント型とイベントクラスを定義するコード DEFINE_EVENT_TYPE( wxEVT_PLOT_ACTION ) wxPlotEvent::wxPlotEvent( ... // イベントを捕まえるユーザコード BEGIN_EVENT_TABLE(MyFrame, wxFrame)

source: wxStdInputStream is a std::istream derived stream which reads from a wxInputStream.
ja: wxStdInputStream は std::istream を継承したストリームで、wxInputStream からデータを読み込みます。

source: wxStdOutputStream is a std::ostream derived stream which writes to a wxOutputStream.
ja: wxStdOutputStream は std::ostream を継承したストリームで、wxOutputStream へデータを書き込みます。

source: wxStream classes are divided in two main groups:
ja: wxStream クラスはふたつの主なグループに分けられます:

source: wxStreamBuffer is a cache manager for wxStreamBase: it manages a stream buffer linked to a stream...
ja: wxStreamBuffer は wxStreamBase 用のキャッシュマネージャです: このクラスはストリームに関連付けられたストリームバッファを管理します。

source: wxStreams is divided in two main parts:
ja: wxStreams は主となるふたつの部分に分けられます:

source: wxString Related Compilation Settings
ja: wxString に関するコンパイル設定

source: wxString is a class which represents a character string of arbitrary length (limited by MAX_INT which is usually 2147483647 on 32 bit machines) and containing arbitrary characters.
ja: wxString は任意の長さ (最大は MAX_INT で、32 ビットマシンの場合、通常は 2147483647 です) で任意の文字を含む文字列を表すクラスです。

source: wxString text = event.GetText(); } // user code sending the event void MyWindow::SendEvent() {
ja: wxString text = event.GetText(); } // イベントを送信するユーザコード void MyWindow::SendEvent() {

source: wxString works with both ASCII (traditional, 7 or 8 bit, characters) as well as Unicode (wide characters) strings.
ja: wxString は ASCII (従来の 7 ビットまたは 8 ビット) 文字列と Unicode (ワイド) 文字列の両方を取り扱うことができます。

source: wxStringCharType is defined to be:
ja: wxStringCharType は次のいずれかの型に定義されます:

source: wxStringTokenizer helps you to break a string up into a number of tokens.
ja: wxStringTokenizer は文字列を複数のトークンに分割することを支援します。

source: wxTE_AUTO_SCROLL style is deprecated as it's always on by default anyhow in the ports which support it so you should simply remove any mentions of it from your code.
ja: wxTE_AUTO_SCROLL スタイルはこれに対応している移植版ではデフォルトで常に有効になっているため、非推奨になりました。そのため、単純にコードから削除してください。

source: wxTempFile provides a relatively safe way to replace the contents of the existing file...
ja: wxTempFile は既存のファイルの置換を行うための比較的安全な方法を提供します。

source: wxTextDataObject is a specialization of wxDataObjectSimple for text data.
ja: wxTextDataObject は wxDataObjectSimple を特殊化したもので、テキストデータに特化しています。

source: wxTextValidator validates text controls, providing a variety of filtering behaviours.
ja: wxTextValidator はテキストコントロールの検証と振る舞いの様々なフィルタリングを行います。

source: wxTimerEvent object is passed to the event handler of timer events (see wxTimer::SetOwner).
ja: wxTimerEvent はタイマーイベントのイベントハンドラへ引き渡されるオブジェクトです。 (wxTimer::SetOwner 参照)

source: wxTopLevelWindow is a common base class for wxDialog and wxFrame.
ja: wxTopLevelWindow は wxDialog と wxFrame の共通の基底クラスです。

source: wxURL is a specialization of wxURI for parsing URLs.
ja: wxURL は URL をパースするために wxURI を特殊化したものです。

source: wxUString is a class representing a Unicode character string where each character is stored using a 3...
ja: wxUString は各文字が 32 ビット値に格納される Unicode 文字列を表したクラスです。

source: wxValidator is the base class for a family of validator classes that mediate between a class of contr...
ja: wxValidator はコントロールクラスとアプリケーションデータを仲介する、バリデータクラスファミリーの基底クラスです。

source: wxWidgets and Standard Streams
ja: wxWidgets と標準ストリーム

source: wxWidgets does not provide translations for all of these currently.
ja: 修飾子の翻訳について、今のところ wxWidgets はすべてに対応しているわけではありません。

source: wxWidgets does not yet handle translated special key names such as Backspace, End, Insert, etc.
ja: Backspace、End、Insert といった特殊キーの名前が翻訳された場合、wxWidgets はまだ取り扱うことができません。

source: wxWidgets has a number of different classes to help with interprocess communication and network programming.
ja: wxWidgets にはプロセス間通信やネットワークプログラミングを支援する様々なクラスがあります。

source: wxWidgets has support for compiling in Unicode mode on the platforms which support it.
ja: wxWidgets は Unicode に対応しているプラットフォームであれば Unicode モードでコンパイルすることが可能です。

source: wxWidgets has the notion of a log target: it is just a class deriving from wxLog.
ja: wxWidgets では ログターゲット という考え方があります: これは単純に wxLog を継承したクラスです。

source: wxWidgets is able to use this catalog under any supported platform (although iso8859-2 is a Unix encoding and is normally not understood by Windows).
ja: wxWidgets の対応しているすべてのプラットフォームでこのカタログを使用できます。(iso8859-2 は Unix のエンコーディングであり、通常は Windows で使用できないとしてもです)

source: wxWidgets looks for a wxStdDialogButtonSizer and uses it for the non-scrolling part.
ja: wxWidgets は wxStdDialogButtonSizer を探してその部分を非スクロール領域として使用します。

source: wxWidgets provides a complete set of classes encapsulating objects necessary in multithreaded (MT) programs: the thread class itself and different synchronization objects: mutexes and critical sections with conditions.
ja: wxWidgets はマルチスレッド (MT) プログラムで必要となるオブジェクトをカプセル化したクラスの一式を提供しています: thread クラス自身と、他の同期オブジェクトである ミューテックス、クリティカルセクション、コンディション が含まれます。

source: wxWidgets provides a complete set of classes encapsulating objects necessary in multithreaded (MT) programs: the wxThread class itself and different synchronization objects: mutexes (see wxMutex) and critical sections (see wxCriticalSection) with conditions (see wxCondition).
ja: wxWidgets はマルチスレッド (MT) プログラムで必要となるオブジェクトをカプセル化したクラスの一式を提供しています: wxThread クラス自身と、他の同期オブジェクトであるミューテックス (wxMutex 参照)、クリティカルセクション(wxCriticalSection 参照)、コンディション (wxCondition 参照) が含まれます。

source: wxWidgets provides facilities for message translation with it's wxLocale class and is itself fully translated into several languages.
ja: wxWidgets は wxLocale クラスを使用したメッセージ翻訳機能を提供しており、wxWidgets 自体がいくつかの言語に完全に翻訳されています。

source: wxWidgets provides facilities for message translation with its wxLocale class and is itself fully translated into several languages.
ja: wxWidgets は wxLocale クラスを使用したメッセージ翻訳機能を提供しており、wxWidgets 自体がいくつかの言語に完全に翻訳されています。

source: wxWidgets provides its own set of stream classes in order to support platforms not providing standard C++ streams implementation and also to make it possible to provide binary versions of wxWidgets application not depending on any particular standard library version.
ja: wxWidgets は標準の C++ ストリームを提供していないプラットフォームに対応するためと、標準ライブラリの特定のバージョンに依存することなく、wxWidgets アプリケーションのバイナリ版を提供可能にするために独自のストリームクラス群を提供しています。

source: wxWidgets provides some functions and classes to facilitate working with files.
ja: wxWidgets はファイルの取り扱いを手助けするための関数やクラスを提供しています。

source: wxWidgets provides the macros __TFILE__, __TDATE__ and __TTIME__ which behave exactly as the standard ones except that they produce ANSI strings in ANSI build and Unicode ones in the Unicode build.
ja: wxWidgets では __TFILE__、 __TDATE__、 __TTIME__ マクロを提供しており、これらは ANSI ビルド時には ANSI 文字列に、 Unicode ビルド時には Unicode 文字列になることを除き、標準トークンとまったく同じに振る舞います。

source: wxWidgets uses the message catalogs which are binary compatible with gettext catalogs and this allows to use all of the programs in this package to work with them.
ja: wxWidgets では gettext のカタログとバイナリ互換性のあるメッセージカタログを使用します。これにより、メッセージカタログを扱う際に gettext のすべてのプログラムを使用できます。

source: wxWidgets uses the system wchar_t in wxString implementation by default under all systems.
ja: すべてのシステムにおいて、wxWidgets はデフォルトで wxString の実装に wchar_t を使用します。

source: wxWidgets' DDE-like protocol is a high-level protocol based on Windows DDE.
ja: wxWidgets の DDE 風プロトコルは Windows DDE に基づく高レベルのプロトコルです。

source: wxWidgets: wxWidgets: Bitmaps and Icons
ja: wxWidgets: wxWidgets: ビットマップとアイコン

source: wxWidgets: wxWidgets: Changes Since wxWidgets 2.8
ja: wxWidgets: wxWidgets: wxWidgets 2.8 からの変更点

source: wxWidgets: wxWidgets: Device Contexts
ja: wxWidgets: wxWidgets: デバイスコンテキスト

source: wxWidgets: wxWidgets: Drag and Drop Overview
ja: wxWidgets: wxWidgets: ドラッグ・アンド・ドロップの概要

source: wxWidgets: wxWidgets: Environment Variables
ja: wxWidgets: wxWidgets: 環境変数

source: wxWidgets: wxWidgets: Events and Event Handling
ja: wxWidgets: wxWidgets: イベントとイベント処理

source: wxWidgets: wxWidgets: File Classes and Functions
ja: wxWidgets: wxWidgets: ファイルクラスと関数

source: wxWidgets: wxWidgets: Internationalization
ja: wxWidgets: wxWidgets: 国際化

source: wxWidgets: wxWidgets: Interprocess Communication
ja: wxWidgets: wxWidgets: プロセス間通信

source: wxWidgets: wxWidgets: Multithreading Overview
ja: wxWidgets: wxWidgets: マルチスレッドの概要

source: wxWidgets: wxWidgets: Sizers Overview
ja: wxWidgets: wxWidgets: サイザーの概要

source: wxWidgets: wxWidgets: Stream classes overview
ja: wxWidgets: wxWidgets: ストリームクラスの概要

source: wxWidgets: wxWidgets: Unicode Support in wxWidgets
ja: wxWidgets: wxWidgets: wxWidgets における Unicode 対応

source: wxWidgets: wxWidgets: Window Deletion
ja: wxWidgets: wxWidgets: ウィンドウの削除

source: wxWidgets: wxWidgets: Window Sizing Overview
ja: wxWidgets: wxWidgets: ウィンドウサイズの概要

source: wxWidgets: wxWidgets: Window Styles
ja: wxWidgets: wxWidgets: ウィンドウスタイル

source: wxWidgets: wxWidgets: Writing Non-English Applications
ja: wxWidgets: wxWidgets: 非英語アプリケーションの作成

source: wxWidgets: wxWidgets: wxApp Overview
ja: wxWidgets: wxWidgets: wxApp の概要

source: wxWidgets: wxWidgets: wxConfig Overview
ja: wxWidgets: wxWidgets: wxConfig の概要

source: wxWidgets: wxWidgets: wxDialog Overview
ja: wxWidgets: wxWidgets: wxDialog の概要

source: wxWidgets: wxWidgets: wxLog Classes Overview
ja: wxWidgets: wxWidgets: wxLog クラスの概要

source: wxWidgets: wxWidgets: wxMBConv Overview
ja: wxWidgets: wxWidgets: wxMBConv の概要

source: wxWidgets: wxWidgets: wxString Overview
ja: wxWidgets: wxWidgets: wxString の概要

source: wxWidgets: wxWidgets: wxValidator Overview
ja: wxWidgets: wxWidgets: wxValidator の概要

source: wxWindow is the base class for all windows and represents any visible object on screen.
ja: wxWindow はすべてのウィンドウの基底クラスであり、画面上に表示されるすべての可視オブジェクトを表しています。

source: wxWizard is the central class for implementing 'wizard-like' dialogs.
ja: wxWizard はウィザード風のダイアログを実装するための中心的なクラスです。

source: wxYES // return wxID_YES
ja: wxYES // wxID_YES を返却します

source: wxYES_NO // Add Yes/No subpanel
ja: wxYES_NO // Yes/No サブパネルを追加します

source: } // ~wxLogNull called, old log sink restored
ja: } // ~wxLogNull が呼ばれ、古いログ出力先が元に戻される
